wlm.samples/resources/AdvancedPurchaseOrder/AdvancedPurchaseOrderBPEL/src/ApprovePurchase_TM_BPEL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="ApprovePurchase_TM_BPEL"
             targetNamespace="http://jbi.com.sun/wfse/samples/adv-purchase-order/wsdl"
             xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:tns="http://jbi.com.sun/wfse/samples/adv-purchase-order/wsdl"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             xmlns:plink="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
             xmlns:po="http://jbi.com.sun/wfse/samples/adv-purchase-order/xsd">

    <types>
        <xsd:schema targetNamespace="http://jbi.com.sun/wfse/samples/adv-purchase-order/wsdl">
            <xsd:import schemaLocation="PurchaseOrder.xsd"
                        namespace="http://jbi.com.sun/wfse/samples/adv-purchase-order/xsd"/>
        </xsd:schema>
    </types>

    <message name="TaskInput">
        <part name="part1" element="po:purchaseOrder"/>
    </message>
    <message name="TaskOutput">
        <part name="part1" element="po:orderReply"/>
    </message>

    <portType name="ApprovePurchasePT">
        <operation name="ApprovePurchase">
            <input name="ApprovePurchaseInput" message="tns:TaskInput"/>
            <output name="ApprovePurchaseOutput" message="tns:TaskOutput"/>
        </operation>
    </portType>

    <plink:partnerLinkType name="ApprovePurchaseLT">
        <plink:role name="ApprovePurchase_Server" portType="tns:ApprovePurchasePT"/>
    </plink:partnerLinkType>
</definitions>
